import { p } from "framer-motion/client";



const zunayedHasanSokal = "/slider_images/8.webp";
const abdulMazidImg = "/slider_images/18.webp";
const abdullahTamim = "/slider_images/16.webp";
const fahimMiya = "/slider_images/13.webp";
const hasanImg = "/slider_images/19.webp";
const ikraIslam = "/slider_images/23.webp";
const khadizaMaya = "/slider_images/15.webp";
const mdIbrahim = "/slider_images/22.webp";
const siyamAli = "/slider_images/24.webp";
const tasimImg = "/slider_images/17.webp";
const mdAymanImg = "/slider_images/10.webp";
const mdHossain = "/slider_images/14.webp";
const mustafizImg = "/slider_images/20.webp";
const rengnayaMurung = "/slider_images/21.webp";
const rihanHossain = "/slider_images/12.webp";
const robiulImg = "/slider_images/7.webp";
const samiraImg = "/slider_images/9.webp";
const zubayerHossain = "/slider_images/11.webp";
const mdTamim = "/slider_images/6.webp";
 



export const memories = [

  {
  name: "জুনায়েদ হোসেন সকাল",
  seat: "ঢাকা ৭ আসন",
  dates: "২১ জানুয়ারী, ২০১৮",
  image_src: {
    small: zunayedHasanSokal,
    large: zunayedHasanSokal,
 
  },
  story: `ঢাকার লালবাগ থেকে সকাল নামের একটি শিশু ২১ জানুয়ারি ২০১৮ থেকে নিখোঁজ।
আজ পেরিয়েছে ৮ বছর, তবুও তাকে উদ্ধার করা যায়নি।
শিশুটি তখন ভিডিও গেম খেলছিল, আর তার ছোট্ট জীবন এক মুহূর্তে হারিয়ে গেল।
পরিবারের প্রতিটি দিন কেটে যাচ্ছে অনিশ্চয়তা, হতাশা এবং ব্যথার সঙ্গে।
কর্তৃপক্ষের সাহায্য প্রার্থনা করে পরিবার বারবার বলছে—আমাদের শিশুটি কোথায়?
এই ৮ বছরের অপেক্ষা, এক পরিবারকে ভেঙে দিয়েছে, কিন্তু আমরা হার মানি না।
আপনি যদি সকালকে দেখে থাকেন বা কোনো তথ্য জানেন, দয়া করে যোগাযোগ করুন এবং সাহায্য করুন।
একটি ছোট্ট সহানুভূতি, একটি শেয়ার, হয়তো তাদের হারানো সন্তানকে ফিরিয়ে আনতে পারে।`,


posterLink:"https://drive.google.com/file/d/1bVCETzKEBvhr5vztXWGspak9r8Jsnq6h/view?usp=sharing",
videoLink:"https://www.youtube.com/watch?v=AKbWPDvgPVo&list=PPSV",
},  

{
  name: "আবদুল্লাহ তামিম",
   seat: "ঢাকা-১৮ আসন ",
  dates: "২০ মে, ২০২৫",
  image_src: {
    small: abdullahTamim,
    large: abdullahTamim,
  },
  story: `২০ মে ২০২৫। সকাল প্রায় ৯টা। প্রতিদিনের মতো স্কুলে যাওয়ার উদ্দেশ্যে বাড়ি থেকে বেরিয়েছিল তামিম। সরিষা-প্রেমটিয়া মাধ্যমিক বিদ্যালয়ের সপ্তম শ্রেণির এই ছাত্রটি—মো. নজরুল ইসলামের একমাত্র ছেলে—সেদিন আর ফিরে আসেনি। পাংশা উপজেলার কলিমহর ইউনিয়নের সাঁজুরিয়া গ্রামে সেই সকালটাই ছিল শেষ স্বাভাবিক সকাল।
দিন গড়িয়েছে, মাস পেরিয়েছে। তামিম নিখোঁজ হওয়ার প্রায় আট মাস কেটে গেছে। সন্তানের খোঁজে তার পরিবার একা থাকেনি। চ্যানেল ২৪–এর প্রতিবেদন অনুযায়ী, ৩ জুন ২০২৫ তারিখে পাংশা পৌর শহরে পরিবার ও এলাকাবাসী মানববন্ধন কর্মসূচি পালন করেছে। সেই মানববন্ধন ছিল নীরব প্রতিবাদ আর অসহায় আকুতির প্রতিচ্ছবি।
এরপরও থেমে থাকেনি চেষ্টা। ফুটবল ম্যাচে প্ল্যাকার্ড প্রদর্শনের মাধ্যমে, সামাজিক যোগাযোগমাধ্যমে ছবি ও বার্তা ছড়িয়ে দিয়ে তামিমের সন্ধানের আহ্বান জানানো হয়েছে। তবুও জুন ২০২৫–এর পর তার অবস্থান সম্পর্কে কোনো নিশ্চিত সরকারি বা সংবাদমাধ্যমের তথ্য সামনে আসেনি।
তামিম আজও নিখোঁজ। আর তার পরিবার আজও অপেক্ষায়—একটি সকাল, একটি দরজা খোলার শব্দ, কিংবা শুধু একটি খবরের আশায়। যতদিন সে ফিরে না আসে, এই অপেক্ষা শেষ হবে না।?`,
posterLink:"https://drive.google.com/file/d/1WE8tcAwQot1wqgNTgOXzFc2TGZqX73SQ/view?usp=sharing",
videoLink:"",
},  






{
  name: "ফাহিম মিয়া",
   seat: "ঢাকা-১৮ আসন",
  dates: "২৫ জানুয়ারী, ২০২৬ ",
  image_src: {
    small: fahimMiya,
    large: fahimMiya,
  },
  story: `নিখোঁজের তারিখ: ২৫ জানুয়ারি ২০২৬ থেকে
ফাহিম পড়াশোনার কথা বলে বাড়ি থেকে বের হয়েছিল।
এর আগেও কয়েকবার এভাবে বের হয়ে গিয়েছিল, তখন তাকে স্টেশন এলাকা থেকে পাওয়া যায়।
কিন্তু এবার অনেক খোঁজাখুঁজি করেও এখনো তার কোনো সন্ধান মেলেনি।
প্রতিটি দিন পরিবারের জন্য কাটছে ভয় আর অনিশ্চয়তার মধ্যে।
একটি পরিবার আজ তার প্রিয় মানুষটির অপেক্ষায় পথ চেয়ে আছে।
আপনি যদি কোথাও ফাহিমকে দেখে থাকেন বা কোনো তথ্য জানেন, দয়া করে যোগাযোগ করুন।
একটি শেয়ারই হয়তো তাকে আবার পরিবারের কাছে ফিরিয়ে দিতে পারে।`,
posterLink:"https://drive.google.com/file/d/1qUSch-uhfXHEGuZiOOF_r_Xg_YgbDdze/view?usp=sharing",
videoLink:"",
},

{
  name: "হাসান",
   seat: "ঢাকা-১৮ আসন ",
  dates: "১০ ডিসেম্বর, ২০২৫",
  image_src: {
    small: hasanImg,
    large: hasanImg,
  },
  story: `ছোট হাসান, মা’র হাত ধরে হাঁটছিল রোজকার মতো।
মা হোস্টেলে কাজ করে, সকাল-সন্ধ্যা ছেলেকে নিয়ে যাওয়া-আসা—আজও ২ নং গেটের কাছে এসে পৌঁছেছে।
হঠাৎ মা’র হাত ছুটে গেল, আর তখনই চোখের পলকে হারিয়ে গেল হাসান |
মা চিৎকার করে ডাকছে, “হাসান! হাসান!” কিন্তু চারপাশে শুধু অচেনা মুখ আর গাড়ির হর্ন।
২ নং গেটের সেই জায়গাটা যেন গিলে খেয়ে ফেলেছে ছোট্ট হাসানকে ।
এখন মা বসে আছে রাস্তার ধারে, হাতে হাসানের ছবিটা চেপে ধরে, চোখে জল আর বুকে একটা ফাঁকা গর্ত—কবে ফিরবে রে আমার হাসান?`,
posterLink:"https://drive.google.com/file/d/1scymIW_3ev5elHZ5l58H5f76nh22RC4t/view?usp=sharing",
videoLink:"",
},

{
  name: "ইকরা ইসলাম",
  seat: "ঢাকা-১৮ আসন",
  dates: "১ নভেম্বর, ২০২৪ ",
  image_src: {
    small: ikraIslam,
    large: ikraIslam,
  },
  story: `২০২৪ সালের ১ নভেম্বর, শুক্রবার বিকেল ৫টার সেই অভিশপ্ত মুহূর্তটি পুরো পরিবারের আকাশ থেকে সবটুকু আলো কেড়ে নিয়েছে। গাজীপুরের সালনা বন বিভাগের সরকারি কোয়ার্টারের যে আঙিনায় একটু আগেও ৫ বছরের ছোট্ট ইকরা ইসলাম হেসে-খেলে বেড়াচ্ছিল, মুহূর্তের ব্যবধানে সেই আঙিনা আজ এক নিস্তব্ধ হাহাকারে পরিণত হয়েছে। ইকরা শুধু আমাদের একটি সন্তান নয়, সে আমাদের পরিবারের প্রাণ।
  তার সেই চঞ্চলতা, ফর্সা গায়ের রঙের মায়াবী চেহারা আর আধো-আধো বুলি ছাড়া আমাদের প্রতিটি সেকেন্ড কাটছে অসহ্য যন্ত্রণায়। মাত্র ৩ ফুট উচ্চতার এই ছোট্ট মানুষটি ছাড়া আমাদের ঘর আজ মরুভূমির মতো খাঁ খাঁ করছে। ওর মা-বাবার চোখের জল আর থামছে না, প্রতিটি পায়ের শব্দে তারা ভাবছেন—এই বুঝি ইকরা ফিরে এলো!`,
  posterLink:"https://drive.google.com/file/d/1NVvB3HBFGz-BYt4NQDz2mnj_OcweTK_s/view?usp=sharing",
  videoLink:"",
},

{
  name: "খাদিজা মায়া",
  seat: "ঢাকা-১৮ আসন",
  dates: "১১ এপ্রিল, ২০২১",
  image_src: {
    small: khadizaMaya,
    large: khadizaMaya,
  },
  story: `চাঁদপুরের শাহরাস্তি থানার ছোটতুলা গ্রামে থাকত পাঁচ বছরের ছোট্ট মেয়েটি খাদিজা আক্তার। বাবার নাম সাব্বির হোসেন (আব্দুল্লাহ), মায়ের নাম ফাতেমা আক্তার।
১১ এপ্রিল ২০২১, সকাল প্রায় ১১টা ৩০ মিনিটে, সে প্রতিদিনের মতো বাড়ির পাশের বাড়িতে খেলতে যায়। কিন্তু সেদিন আর ফিরে আসেনি।
খোঁজ করা হয় চারপাশে, গ্রামের অলিগলিতে, পুকুরপাড়ে—কিন্তু কোথাও পাওয়া যায়নি তাকে। মুহূর্তেই আনন্দের বাড়ি নেমে আসে গভীর শূন্যতায়।
আজও সেই বাড়িতে অপেক্ষা থেমে নেই।
মায়ের চোখে জল, বাবার বুকে একটাই আশা—
কোনো একদিন খাদিজা ফিরে আসবে।
এটি কোনো গল্প নয়, এটি একটি নিখোঁজ শিশুর বাস্তব কাহিনি।
একটু সহানুভূতি, একটু সাহায্য—হয়তো একটি শিশুকে ঘরে ফিরিয়ে দিতে পারে।`,
posterLink:"https://drive.google.com/file/d/1P-5wN7s77smyspjEg3QjpXCpPIesrxB9/view?usp=sharing",
videoLink:"",
},


{
  name: "সিয়াম আলী",
  seat: "ঢাকা-১৮ আসন ",
  dates: "১৫ নভেম্বর, ২০২৫",
  image_src: {
    small:siyamAli ,
    large: siyamAli,
  },
  story: `কোথায় তুমি সিয়াম?
এই সেই সিয়াম, যাকে খুঁজে বেড়াচ্ছে তার অসহায় বাবা মা| মা আজো রোজ গরম ভাত থালায় বেড়ে অপেক্ষা করেন এই খোকা এলো বলে|
বাবা আজো মুঠোফোন হাতে নিয়ে অপেক্ষা করেন, সিয়ামের খোঁজ পাওয়ার সংবাদ এলো বলে| কেউ কেউ বলে সর্বশেষ তাকে রংপুরে দেখা গিয়েছে|
আপনি কি তাকে দেখেছেন?`,
posterLink:"https://drive.google.com/file/d/1I3JW4X9HY8I7VA8aWuIxzk8NhA4s3Ger/view?usp=sharing",
videoLink:"",
},


{
  name: "মোঃ হোসেন",
  seat: "ঢাকা-১৮ আসন ",
  dates: "৬ ফেব্রুয়ারী, ২০২৬",
  image_src: {
    small: mdHossain,
    large: mdHossain,
  },
  story: `একটি পরিবার তাদের ছোট্ট সন্তান হোসাইন (বয়স ৯ বছর) এর খোঁজে এখনো উদ্বিগ্ন।
পিতা কামরুল, বাড়ি চক পাড়া। অনেক খোঁজাখুঁজির পরও শিশুটির কোনো সন্ধান পাওয়া যায়নি।
একটি শিশু কোথায় আছে, কেমন আছে—এই অনিশ্চয়তাই পরিবারটিকে ভেঙে দিচ্ছে।
আপনার আশেপাশে, রাস্তায়, বাজারে, বাসস্ট্যান্ড বা কোনো স্থানে যদি শিশুটিকে দেখে থাকেন, দয়া করে বিষয়টি অবহেলা করবেন না।
একটু সহযোগিতাই পারে একটি পরিবারকে তাদের হারানো সন্তানকে ফিরিয়ে দিতে।`,
posterLink:"https://drive.google.com/file/d/1tRLzyoDbkfr_NR3XAVcvxNG9DojTvNLS/view?usp=sharing",
videoLink:"",
},


{
  name: "মোঃ তামিম",
  seat: "ঢাকা-১৮ আসন ",
  dates: "২৪ জানুয়ারী, ২০২৬",
  image_src: {
    small: mdTamim,
    large: mdTamim,
  },
  story: `তামিম ছিল খুব সাধারণ একটি ছেলে, পরিবারের সকলের চোখের মণি। তার হাসিতে ভরে থাকত বাড়ি। কিন্তু হঠাৎ করেই সব কিছু বদলে গেল। গত ২৪-০১-২০২৬ তারিখে রাত ৯টার দিকে সে বাসা থেকে নতুন বাজার আসার পথে হঠাৎ নিখোঁজ হয়ে যায়। অনেক খোঁজাখুঁজি করেও তার কোনো সন্ধান মেলেনি।
নিখোঁজ শিশুটির মাথায় একটি কাটার দাগ রয়েছে। পরনে ছিল প্যান্ট, শার্ট এবং একটি কালো সুয়েটার।
যদি কোনো হৃদয়বান ব্যক্তি এই শিশুটির খোঁজ জানেন, দয়া করে জানাবেন। একটি অসহায় পরিবার তাদের সন্তানের অপেক্ষায় প্রতিটি মুহূর্ত কষ্ট সহ্য করছে। আপনার সামান্য তথ্য তাদের বড় সাহায্য করতে পারে।
আমরা কি এই বার্তাটি আরও মানুষের কাছে পৌঁছে দিতে শেয়ার করতে পারি?`,
posterLink:"https://drive.google.com/file/d/1SZ4lULqHJpUzk1RpVTRHwK1czG-QWBXD/view?usp=sharing",
videoLink:"",
},

{
  name: "মোঃ মুস্তাফিজ",
  seat: "দিনাজপুর ৫ আসন ",
  dates: "২৩ ডিসেম্বর, ২০২৫",
  image_src: {
    small: mustafizImg,
    large: mustafizImg,
  },
  story: `২০২৫ সালের ২৩শে ডিসেম্বর, শীতের এক সন্ধ্যায় পার্বতীপুরের আকাশ যখন কুয়াশায় ঢেকে যাচ্ছিল, ঠিক তখনই একটি পরিবারের সব আনন্দ চিরতরে ফিকে হয়ে যায়। ১৪ বছরের কিশোর মুস্তাফিজ প্রতিদিনের মতোই বাড়ির পাশে ব্যাডমিন্টন খেলছিল। র‍্যাকেটের প্রতিটি শব্দ আর তারুণ্যের প্রাণচঞ্চলতায় মুখরিত ছিল চারপাশ। কিন্তু সন্ধ্যা গড়িয়ে রাত নামলেও, সেই চঞ্চল ছেলেটি আর ঘরে ফেরেনি।
মুস্তাফিজের বাবা একজন শ্রবণ প্রতিবন্ধী। তিনি হয়তো কানে শুনতে পান না, কিন্তু সন্তানের জন্য তার বুকের ভেতরের হাহাকার কোনো শব্দের চেয়ে কম নয়। যে বাবা মুখে কথা বলতে পারেন না, তার চোখের জল আর অস্থির পায়চারি আজ এক নিস্তব্ধ আর্তনাদে পরিণত হয়েছে। এর আগেও মুস্তাফিজ একবার নিখোঁজ হয়ে দ্রুত ফিরে এসেছিল, তাই পরিবার হয়তো ভেবেছিল এবারও হয়তো সে কোনো পরিচিত মুখ হয়ে ফিরে আসবে। কিন্তু সময় যত গড়াচ্ছে, অন্ধকার যেন আরও ঘনীভূত হচ্ছে।`,
posterLink:"https://drive.google.com/file/d/1-maFRVNBwzhGHKx9UP-11qOP7fRJGhc4/view?usp=sharing",
},

{
  name: "রেংনায়া মুরুং",
  seat: "ঢাকা-১৮ আসন ",
  dates: "২৫ সেপ্টেম্বর, ২০২৫",
  image_src: {
    small: rengnayaMurung,
    large: rengnayaMurung,
  },
  story: `স্কুল হোস্টেলের সেই হাস্যজ্জল মুখ, যার হাসিতে প্রাণবন্ত থাকতো হোস্টেলের প্রতিটি কোনা|
  কিন্তু সেপ্টেম্বরের কোনো এক নিকষ কালো প্রহরে সেই হাসি মিলিয়ে যায় অজানায়|
  স্কুল কর্তৃপক্ষ জানে না, জানে না হোস্টেলের ফুল বাগানের ছোট ফুলটি , কোথায় হারালো সেই হাসিমুখ, নিষ্পাপ মুরং|
  পরিবার আজও খুঁজে চলেছে সেই অজানা ঠিকানা |`,
  posterLink:"https://drive.google.com/file/d/1z2z4mUIsyruEq3_G9epES0Q87ilcCrB6/view?usp=sharing",
},

{
  name: "রবিউল",
  seat: "ঢাকা-১৩ আসন ",
  dates: "৬ ডিসেম্বর, ২০২৫",
  image_src: {
    small: robiulImg,
    large: robiulImg,
  },
  story: `ভিড়ের মাঝে হঠাৎ হারিয়ে যায় ১২ বছরের কিশোরী এইচ শেহজাদি হাসনা।
০৬/১২/২০২৫, শনিবার—ঘোটা বাস স্ট্যান্ড থেকে সে আর বাড়ি ফেরেনি।
শ্যামলা গায়ের রং, গোল মুখ, উচ্চতা প্রায় ৪ ফুট—এই চেহারার মেয়েটিকে যদি কেউ দেখে থাকেন,
দয়া করে একটি ফোন করুন।
একটি খবরই ফিরিয়ে দিতে পারে একটি শিশুকে তার পরিবারের কাছে।
মানবিক অনুরোধ—দয়া করে শেয়ার করুন।`,
posterLink:"https://drive.google.com/file/d/1nwEi3dAl89onB-fnRUEr7Yke_H3EcmZ-/view?usp=sharing",
},

{
  name: "রিহান হোসেন",
  seat: "ঢাকা-১৮ আসন ",
  dates: "২৩ জানুয়ারি ২০২৬",
  image_src: {
    small: rihanHossain,
    large: rihanHossain,
  },
  story: `মুকুন্দপুর গ্রামের আকাশ আজ ভারী হয়ে আছে।  ছোট্ট রিহান হুসাইন হারিয়ে গেছে—একটা পরিবারের হাসি, আশা আর স্বপ্ন যেন হঠাৎ করেই অদৃশ্য হয়ে গেছে। সে শুধু একটা বাচ্চা না, সে একটা পরিবারের পুরো পৃথিবী। মানবিকতার খাতিরে অনুরোধ—যদি কেউ তাকে দেখে থাকেন বা কোনো তথ্য জানেন, দয়া করে যোগাযোগ করুন। আপনার একটা ছোট্ট সহানুভূতি, একটা শেয়ার, একটা ফোন কলই হতে পারে রিহানের ঘরে ফিরে আসার পথ ।`,
posterLink:"https://drive.google.com/file/d/1OJrdY51WBnp2QUI3A4fvLWew9sIj9Kas/view?usp=sharing",
},





{
  name: "আব্দুল মজিদ",
  seat: "ঢাকা-১৮ আসন ",
  dates: "১৬ সেপ্টেম্বর, ২০২৫",
  image_src: {
    small: abdulMazidImg,
    large: abdulMazidImg,
  },
  story: `নরম বিকেলের আলোয় রানাভোলা উত্তর রোডের মোড়টা ছিল চেনা কোলাহলে ভরা। মেঘকা মেম্বারের বাড়ির পাশের মাঠে সেদিন খেলছিল আড়াই বছরের ছোট্ট আব্দুল মাজিদ। ফর্সা গায়ের রং, পরনে সাদা কাপড়—হাসিতে ভরা তার ছোট্ট মুখটা যেন মাঠের সবুজে আলাদা করে ঝিলমিল করছিল।

কিন্তু মুহূর্তের অসাবধানতায় খেলাটা থেমে গেল। ৭ই মার্চ ২০২৫—সেদিনের বিকেল থেকে আব্দুল মাজিদ আর ফিরে এল না। বাবা মো. লালচান, মা মোহা. মিম—দু’জনেই পথ চেয়ে রইলেন, ডাক দিলেন নাম ধরে, মাঠ পেরিয়ে গলি-ঘুপচি খুঁজলেন। উত্তর এল না।

রাত নামল, তবু আশাটা নিভল না। কারণ কোথাও না কোথাও নিশ্চয়ই কেউ একজন তাকে দেখেছে—কেউ একজন ভালো মানুষ। যদি কোনো সদয় হৃদয় ছোট্ট ছেলেটির সন্ধান পেয়ে থাকেন, তবে দয়া করে পরিচিত ঠিকানায় খবর দিন। একটি ফোনকলেই হয়তো আবার জ্বলে উঠবে একটি ঘর, ফিরে আসবে এক শিশুর হাসি।`,
posterLink:"https://drive.google.com/file/d/1zH8cOor_ifyJKnK8jacDfHmHnu-by9pQ/view?usp=sharing",
 
},


















]